tap "caryll/tap"
tap "cjbassi/gotop"
tap "elastic/tap"
tap "getantibody/tap"
tap "github/gh"
tap "go-delve/delve"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "paulche/sudo-touchid"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "stripe/stripe-cli"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Avro command-line tools and utilities
brew "avro-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Decentralized, peer to peer payment network
brew "bitcoin"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# New way to see and navigate directory trees
brew "broot"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-file caching compiler wrapper
brew "ccache"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Run arbitrary commands when files change
brew "entr"
# Library for fast text representation and classification
brew "fasttext"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Compression/decompression library aiming for high speed
brew "snappy"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Serialization library for C++, supporting Java, C#, and Go
brew "flatbuffers"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Search and News from the command-line
brew "googler"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Make JSON greppable
brew "gron"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Pager program similar to more
brew "less"
# Key-value storage library with ordered mapping
brew "leveldb"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# Extremely Fast Compression algorithm
brew "lz4"
# Keep your Mac's application settings in sync
brew "mackup"
# Java-based project management
brew "maven"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@14"
# Platform built on V8 to build network applications
brew "node@16", link: true
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# PDF to HTML converter
brew "pdf2htmlex"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Bash completion for Pip
brew "pip-completion"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# Count lines of code in many languages
brew "sloccount"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# User interface to the TELNET protocol
brew "telnet"
# Framework for scalable cross-language services development
brew "thrift"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# HTTP benchmarking tool
brew "wrk"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# GTK+ dialog boxes for the command-line
brew "zenity"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Parses & writes SFNT structures.
brew "caryll/tap/otfcc-mac64"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Apple TV Aerial screensaver
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Bitcoin client and wallet
cask "bitcoin-core"
# API documentation browser and code snippet manager
cask "dash"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-roboto-mono"
# Free and open-source image editor
cask "gimp"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Office suite
cask "libreoffice"
# Animated screen capture application
cask "licecap"
# Open-source, KeePass-client and password manager
cask "macpass"
# Watch movies and TV shows instantly
cask "popcorn-time-beta"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
# Time optimising application
cask "rescuetime"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source BitTorrent client
cask "transmission"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Compatibility layer to run Windows applications
cask "wine-staging"
# Open-source version of the X.Org X Window System
cask "xquartz"
