tap "caryll/tap"
tap "cjbassi/gotop"
tap "getantibody/tap"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "kryptco/tap"
tap "paulche/sudo-touchid"
cask "osxfuse"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Avro command-line tools and utilities
brew "avro-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Debugger for the Go programming language.
brew "delve"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Distributed search & analytics engine
brew "elasticsearch"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Compression/decompression library aiming for high speed
brew "snappy"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Serialization library for C++, supporting Java, C#, and Go
brew "flatbuffers"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Google Search and News from the command-line
brew "googler"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Key-value storage library with ordered mapping
brew "leveldb"
# GNOME XML library
brew "libxml2"
# Extremely Fast Compression algorithm
brew "lz4"
# Keep your Mac's application settings in sync
brew "mackup"
# Java-based project management
brew "maven"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# Network grep
brew "ngrep"
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# PDF to HTML converter
brew "pdf2htmlex"
# Bash completion for Pip
brew "pip-completion"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Protocol buffers (Google's data interchange format)
brew "protobuf@3.1"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# The Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fuzzy Finder in rust!
brew "sk"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Framework for scalable cross-language services development
brew "thrift"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Download and install various runtime libraries
brew "winetricks"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# GTK+ dialog boxes for the command-line
brew "zenity"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Parses & writes SFNT structures.
brew "caryll/tap/otfcc-mac64"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# A fork of `sudo` with Touch ID support.
brew "paulche/sudo-touchid/sudo-touchid"
cask "1password"
cask "aerial"
cask "android-platform-tools"
cask "atom-beta"
cask "chromedriver"
cask "disk-inventory-x"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-monoid"
cask "font-roboto"
cask "font-roboto-mono"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "iina"
cask "iterm2"
cask "java"
cask "keepassxc"
cask "keybase"
cask "libreoffice"
cask "licecap"
cask "macpass"
cask "mtmr"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rescuetime"
cask "send-to-kindle"
cask "softu2f"
cask "spectacle"
cask "sqlitebrowser"
cask "steam"
cask "switchresx"
cask "tad"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
