tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# AWS SDK for C++
brew "aws-sdk-cpp"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Application-level logging library
brew "glog"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Extremely Fast Compression algorithm
brew "lz4"
# Optimized BLAS library
brew "openblas"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Package for scientific computing with Python
brew "numpy", link: false
# JSON parser/generator for C++ with SAX and DOM style APIs
brew "rapidjson"
# Compression/decompression library aiming for high speed
brew "snappy"
# Framework for scalable cross-language services development
brew "thrift"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk@11"
# Google's own build tool
brew "bazel", link: false
# User-friendly launcher for Bazel
brew "bazelisk"
# Collection of portable C++ source libraries
brew "boost"
# Object-file caching compiler wrapper
brew "ccache"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Run arbitrary commands when files change
brew "entr"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Serialization library for C++, supporting Java, C#, and Go
brew "flatbuffers"
# Software library to render fonts
brew "freetype"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# File format designed to store large amounts of data
brew "hdf5"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Next-gen compiler infrastructure
brew "llvm"
# Next-gen compiler infrastructure
brew "llvm@12"
# Keep your Mac's application settings in sync
brew "mackup"
# Modern and intuitive terminal-based text editor
brew "micro"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Network grep
brew "ngrep"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: true
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Tool to run Windows software
cask "crossover"
# API documentation browser and code snippet manager
cask "dash"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Animated screen capture application
cask "licecap"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
# Video game digital distribution service
cask "steam"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source BitTorrent client
cask "transmission"
# Stream media from your computer to Chromecast
cask "videostream"
# Open-source code editor
cask "visual-studio-code"
