adpyke.vscode-sql-formatter
dbaeumer.vscode-eslint
deerawan.vscode-dash
eamodio.gitlens
ecmel.vscode-html-css
file-icons.file-icons
GitHub.copilot
GitHub.vscode-pull-request-github
golang.go
google.vscode-bigquery
googlecloudtools.cloudcode
Gruntfuggly.activitusbar
Gruntfuggly.todo-tree
hex-ci.stylelint-plus
IgorSbitnev.error-gutters
kahole.magit
keesschollaart.vscode-home-assistant
lei.theme-chromodynamics
mads-hartmann.bash-ide-vscode
magicstack.Chromodynamics
magicstack.MagicPython
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-pyright.pyright
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
ms-vsonline.vsonline
Orta.vscode-jest
redhat.vscode-commons
redhat.vscode-yaml
robinbentley.sass-indented
sleistner.vscode-fileutils
streetsidesoftware.avro
tgriesser.avro-schemas
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime
wholroyd.jinja
YoshinoriN.current-file-path
