dbaeumer.vscode-eslint
ecmel.vscode-html-css
file-icons.file-icons
GitHub.copilot
GitHub.vscode-pull-request-github
golang.go
googlecloudtools.cloudcode
Gruntfuggly.activitusbar
IgorSbitnev.error-gutters
magicstack.Chromodynamics
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
redhat.vscode-commons
redhat.vscode-yaml
sleistner.vscode-fileutils
streetsidesoftware.avro
stylelint.vscode-stylelint
tgriesser.avro-schemas
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime
YoshinoriN.current-file-path
