dbaeumer.vscode-eslint
dzannotti.vscode-babel-coloring
ecmel.vscode-html-css
file-icons.file-icons
GitHub.vscode-pull-request-github
Gruntfuggly.todo-tree
IgorSbitnev.error-gutters
keesschollaart.vscode-home-assistant
lei.theme-chromodynamics
mads-hartmann.bash-ide-vscode
magicstack.MagicPython
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.Go
orepor.color-tabs-vscode-ext
redhat.java
redhat.vscode-yaml
robinbentley.sass-indented
sleistner.vscode-fileutils
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
WakaTime.vscode-wakatime
wholroyd.jinja
wix.vscode-import-cost
YoshinoriN.current-file-path
zhuangtongfa.material-theme
